app/views/groups/_index.html.erb

  <% @groups.each do |group| %>
   <% @owner = User.find_by(id: group.owner_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

          </p>
          <p class="card-text">メンバー数<%= group.users.count %></p>
---
SELECT COUNT(*) FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]