app/views/books/_index.html.erb

        <td>
          <p>コメント数：<%= book.post_comments.count %></p>
        </td>
        <td>閲覧数 :<%= book.sees.count %></td>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "sees" WHERE "sees"."book_id" = ?  [["book_id", 7]]