app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @post_comment = PostComment.new
    @see = See.find_by(user_id: current_user.id, book_id: @book.id )
    if @see.nil?
      See.create(user_id: current_user.id, book_id: @book.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "sees".* FROM "sees" WHERE "sees"."user_id" = ? AND "sees"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 7], ["LIMIT", 1]]
INSERT INTO "sees" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 7], ["created_at", "2022-01-06 10:29:51.350882"], ["updated_at", "2022-01-06 10:29:51.350882"]]

  def index
    @book = Book.new
    @books = Book.all.order(created_at: :DESC)
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    tag_list = params[:book][:tag_name].split(",")
    if @book.save
      @book.tags_save(tag_list)
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate") VALUES (?, ?, ?, ?, ?, ?)  [["title", "aa"], ["body", "aa"], ["user_id", 1], ["created_at", "2022-01-01 12:00:37.973488"], ["updated_at", "2022-01-01 12:00:37.973488"], ["rate", 5.0]]
SELECT "books".* FROM "books"