app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."room_id" = ? ORDER BY "chats"."created_at" DESC  [["room_id", 1]]
---
  def show
    @user = User.find(params[:id])
    rooms = current_user.user_rooms.pluck(:room_id)
    user_rooms = UserRoom.find_by(user_id: @user.id, room_id: rooms)

    if user_rooms.nil?
      @room = Room.new
      @room.save
      UserRoom.create(user_id: @user.id, room_id: @room.id)
      UserRoom.create(user_id: current_user.id, room_id: @room.id)
    else
      @room = user_rooms.room
    end

    @chats = @room.chats.order(created_at: :DESC)