app/controllers/event_notices_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @group = Group.find(params[:group_id])