app/controllers/groups_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @group = Group.find(params[:id])
    @owner = User.find_by(id: @group.owner_id)