app/controllers/group_users_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["group_id", 1], ["created_at", "2022-01-07 12:39:35.538822"], ["updated_at", "2022-01-07 12:39:35.538822"]]
---
  def create
    @group = Group.find(params[:group_id])
    GroupUser.create(user_id: current_user.id, group_id: @group.id)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "group_users" WHERE "group_users"."id" = ?  [["id", 3]]
SELECT  "group_users".* FROM "group_users" WHERE "group_users"."user_id" = ? AND "group_users"."group_id" = ? LIMIT ?  [["user_id", 1], ["group_id", 1], ["LIMIT", 1]]
---
  def destroy
    @group = Group.find(params[:group_id])
    GroupUser.find_by(user_id: current_user.id, group_id: @group.id).destroy