app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    @group.owner_id = current_user.id
    if @group.save
      GroupUser.create(user_id: current_user.id, group_id: @group.id)
---
INSERT INTO "groups" ("name", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bb"], ["owner_id", 2], ["created_at", "2022-01-07 09:06:44.617803"], ["updated_at", "2022-01-07 09:06:44.617803"]]
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["group_id", 1], ["created_at", "2022-01-07 09:06:44.635319"], ["updated_at", "2022-01-07 09:06:44.635319"]]

  def index
    @book = Book.new
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    @book = Book.new
    @group = Group.find(params[:id])
    @group_user = GroupUser.find_by(user_id: current_user.id, group_id: @group.id)
    @users = @group.users
    @owner = User.find_by(id: @group.owner_id)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "group_users".* FROM "group_users" WHERE "group_users"."user_id" = ? AND "group_users"."group_id" = ? LIMIT ?  [["user_id", 1], ["group_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @group = Group.find(params[:id])
    if @group.update(group_params)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "groups" SET "introduction" = ?, "image_id" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["introduction", "bb"], ["image_id", "4da47b7d8620f45978e30b6ecf9630fe48a6c8245cc54749f2ab73430c8a"], ["updated_at", "2022-01-07 09:30:01.548159"], ["id", 1]]