app/models/book.rb

SELECT "books".* FROM "books"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4], ["book_id", 5], ["book_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]
---
  def self.sort(selection)
    case selection
    when 'new'
      return all.order(created_at: :DESC)
    when 'old'
      return all.order(created_at: :ASC)
    when 'like'
      return all.order(rate: :DESC)
    when 'dislike'
      return all.order(rate: :ASC)
    when 'rock'
      return includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}
    when 'unrock'
      return includes(:favorited_users).sort {|a,b| a.favorited_users.size <=> b.favorited_users.size}

SELECT "book_tags".* FROM "book_tags" WHERE "book_tags"."book_id" = ?  [["book_id", 7]]
INSERT INTO "book_tags" ("book_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["tag_id", 1], ["created_at", "2022-01-01 12:00:38.006312"], ["updated_at", "2022-01-01 12:00:38.006312"]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "tt"], ["created_at", "2022-01-02 13:30:36.260315"], ["updated_at", "2022-01-02 13:30:36.260315"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag_name" = ? ORDER BY "tags"."id" ASC LIMIT ?  [["tag_name", "tt"], ["LIMIT", 1]]
INSERT INTO "book_tags" ("book_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 7], ["tag_id", 5], ["created_at", "2022-01-02 13:30:36.273448"], ["updated_at", "2022-01-02 13:30:36.273448"]]
---
  def tags_save(tag_list)
    if self.tags != nil
      book_tags_records = BookTag.where(book_id: self.id)
      book_tags_records.destroy_all
    end

    tag_list.each do |tag|
      inspected_tag = Tag.where(tag_name: tag).first_or_create
      self.tags << inspected_tag